//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДатаРождения(Парам01)","ДатаРождения","Допустим дата рождения 30.07.1986");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДатаСреза(Парам01)","ДатаСреза","И дата среза 17.09.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВозрастВМесяцахРавен(Парам01)","ВозрастВМесяцахРавен","Тогда возраст в месяцах равен 362");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим дата рождения 30.07.1986
//@ДатаРождения(Парам01)
Процедура ДатаРождения(ДатаРождения) Экспорт
	Контекст.Вставить("ДатаРождения", ДатаРождения);
КонецПроцедуры

&НаКлиенте
//И дата среза 17.09.2016
//@ДатаСреза(Парам01)
Процедура ДатаСреза(ДатаСреза) Экспорт
	Контекст.Вставить("ДатаСреза", ДатаСреза);
КонецПроцедуры

&НаКлиенте
//Тогда возраст в месяцах равен 37
//@ВозрастВМесяцахРавен(Парам01)
Процедура ВозрастВМесяцахРавен(ОжидаемыйРезультат) Экспорт
	Результат = ОбщийМодуль1.ВозрастВМесяцах(Контекст.ДатаРождения, Контекст.ДатаСреза);
	Если Не Результат = ОжидаемыйРезультат Тогда
		ВызватьИсключение "Результат неверный";
	КонецЕсли;	
	
КонецПроцедуры

//окончание текста модуля
